{
  "Openness": {
    "Synonym": "Creativity",
    "Description": "People who are average in openness or creativity find beauty reasonably important. They may enjoy an outlet for their creative ability, but will not wither away without it. They can appreciate art or beautiful crafts. They are somewhat sensitive to color and architectural form. They sometimes enjoy collecting, but it is rare for them to pursue it passionately. They are reasonably imaginative, and may daydream and reflect on occasion. They tend to enjoy music, often of the more conventional popular forms, and may be somewhat musical or artistic themselves. They do not generally become so immersed in a book, or a movie, or in their own thoughts, that they lose touch with the outside world. They are interested in but by no means obsessed with beauty, creativity, and art."
  },
  "Intellect": {
    "Note": "Do not confuse the personality aspect of Intellect with IQ. Intellect is a measure of interest in abstract ideas, essentially, while IQ is a measure of processing speed, verbal ability, working memory, and problem solving capacity, and is better measured with a formal IQ test.",
    "Description": "People typical in intellect can be interested in ideas and abstract concepts. They don't mind and sometimes enjoy being confronted with novel information, however, even if it is complex. They are as curious as the average person, and occasionally like to tackle and solve intellectual problems. They are sometimes compelled to engage in philosophical discussions, and to enjoy complex books (most frequently non-fiction), but more straightforward issues and topics are generally sufficient. They are acceptably articulate and can formulate and communicate their ideas reasonably well (particularly if average or higher in extraversion). They have a vocabulary of normal breadth and depth, and can enjoy learning new things. Occasionally they will seek out or generate novel, creative concepts and find and adapt well to new experiences and situations."
  },
  "Openness to Experience": {
    "Description": "People with typical levels of openness to experience are as smart and creative as others, on average. They are not generally characterized as exploratory or visionary, but have their moments of insight and realization. They are sometimes interested in learning for its own sake and show some interest in acquiring new abilities and skills. They are not overwhelmingly curious, and are not strikingly interested in abstract thinking, philosophy, or the meaning of belief systems and ideologies. They will attend cultural events such as movies, concerts, dance recitals, plays, poetry readings, gallery openings, and art shows, but do not find themselves compelled to do so. They sometimes enjoy writing and will occasionally enjoy encountering and trying to solve a complex problem, or explore abstract ideas."
  },
  "Volatility": {
    "Description": "Individuals moderately low in volatility tend not to vary much in their mood. They are not particularly irritable, and feel lower levels of disappointment, frustration, pain, and social isolation. People find them easy to be around. They express their frustration, disappointment, and irritability quite reasonably and not very often. Even when stirred up and upset or angry or irritated, they calm down quickly. They are less argumentative than average and rarely lose their composure. If overly provoked in a dispute, a person of average volatility may react in kind (particularly if also low in agreeableness). However, such people tend to remain calm and unperturbed, even when stressed. Volatile people tend to get upset if something bad does happen, while people high in withdrawal (the other aspect of neuroticism) tend to be concerned that something bad might happen. Technically, volatility has been associated with activity in the brain systems that regulate fight, flight, or freeze."
  },
  "Withdrawal": {
    "Description": "Individuals average in withdrawal may occasionally suffer from anticipatory anxiety, but are generally not impeded by it. They can handle new, uncertain, unexpected, threatening, or complex situations quite well. They are not more likely to avoid or withdraw in the face of the unknown and unexpected. People with average levels of withdrawal sometimes feel sad, lonesome, disappointed, and grief-stricken, but not too deeply, and not for too long. They experience normal levels of doubt and worry, embarrassment, self-consciousness, and discouragement in the face of threat and punishment. They are reasonably but not excessively sensitive to social rejection and don't feel hurt too easily. Even when hurt, frightened, or anxious, they can recover in a reasonable amount of time. People with typical levels of withdrawal are not particularly concerned that something bad is going to happen. Technically, withdrawal has been associated with activity in the brain systems that regulate passive avoidance."
  },
  "Neuroticism": {
    "Description": "People with moderately low levels of neuroticism tend not to focus on the negative elements, anxieties, and uncertainties of the past, present, and future. They can have periods of time where they are unhappy, anxious, and irritable, particularly when facing a serious, sustained problem, but they generally cope well, don't worry too much, and recover comparatively quickly when stressed. They are pretty good at keeping their head in a storm, and they tend not to make mountains out of molehills."
  },
  "Assertiveness": {
    "Description": "Very assertive people are take charge types. They put their own opinions forward uncommonly strongly, and tend to dominate and control social situations. Very assertive people can be strikingly influential and captivating. They have the communication style that is often associated with leadership. This is good when they are knowledgeable, competent, and able, but not so good when they aren't. Assertive people are people of action. They don't wait for others to lead the way, but leap in, heedlessly. They can be impulsive, in consequence, and can act without thinking."
  },
  "Enthusiasm": {
    "Description": "Individuals moderately high in enthusiasm are somewhat excitable, happy, and easier to get to know. They will talk more about everything (particularly other people) than the typical person. They laugh or giggle more than average. They would rather spend time around other people than alone, and they tend to like parties. They don't generally keep people at a distance and are not too concerned with keeping things private. They are comparatively positive and optimistic. They warm up quickly to other people. They like stimulation, excitement, activity, and fun. Enthusiastic people are gregarious, encouraging, and people-loving, and tend to be quite positive about what might happen next."
  },
  "Extraversion": {
    "Description": "People with very high levels of extraversion are very enthusiastic, talkative, assertive in social situations, and gregarious. They are highly energized by social contact, and crave it. They find great pleasure in planning parties, telling jokes, making people laugh, and taking part in community activities. They typically have positive memories of the past, high levels of current self-esteem (particularly if they are low in neuroticism), and experience far above average optimism about the future."
  },
  "Orderliness": {
    "Description": "Moderately orderly people are more disgust-sensitive than average, somewhat judgmental, and have a tendency towards more authoritarian political attitudes. Moderately orderly people can be somewhat disturbed even disgusted by mess and chaos. They would rather keep everything tidy and organized. They think in comparatively black and white terms: things are basically good or bad, acceptable or unacceptable, with less room for grey areas. They tend both to make and stick to schedules. They like everything where it should be and are happier if it stays where it should be. They are somewhat detail-oriented but tend not to be obsessive. They are generally aware of social rules and tend to abide by them. They like routine and prefer the predictable. They can be good at ensuring that complex, sensitive processes are managed properly and carefully."
  },
  "Industriousness": {
    "Description": "Very industrious people are typically successful in school and in administrative and managerial positions (particularly if they are intelligent). They live primarily to work and always have to be doing something useful. They do not like to sit around. They are very dutiful. They don't put things off or mess things up. They finish what they start, and they do it on schedule. They are always considering how to accomplish more in less time, with fewer resources. They have remarkable focus."
  },
  "Conscientiousness": {
    "Description": "People high in conscientiousness are dutiful. They slog away until the work is done. They work hard and dislike wasting time. They are unlikely to procrastinate (particularly if they are also below average in neuroticism). If a highly conscientious person promises to do something, he or she will probably do it, even in troubled circumstances, without excuses. They are decisive, neat, organized, future-oriented, reliable, and not easily distracted."
  },
  "Politeness": {
    "Description": "Typically polite people can be deferential to authority, but can also be challenging, when necessary. They are not particularly obedient. They can be respectful, but will also push back if pushed. They are not made uncomfortable by the necessity of standing up to other people. Typically polite people will avoid conflict, reasonably, but are not completely averse to confrontation."
  },
  "Compassion": {
    "Description": "Highly compassionate people are much interested in the problems of other people, and other living things, particularly if they are young or helpless. They are quite concerned about helping other people avoid negative emotion. They make more time and do more kind things for others, even when doing so may interfere with fulfilling their own needs and interests. They have a markedly soft side. Other people consider them sympathetic and nice, and will turn to them often for a listening ear. They are highly empathetic and caring. However, because they are so other-oriented, they may find it difficult to negotiate on their own behalf, and may not get what they deserve (for their hard work, for example). This can lead to resentment."
  },
  "Agreeableness": {
    "Description": "People with moderately high levels of agreeableness are seen by others as cooperative, warm, and considerate. They are likely to look for and even sometimes to see the best in others, and are interpersonally tolerant (an attitude that is much valued by agreeable people). They do not like seeing someone's feelings get hurt, and are concerned about the emotional state of others, preferring peace and harmony. They tend somewhat towards submissiveness, rather than dominance (particularly if also below average in neuroticism)."
  }
}